[
    {
        "slug": "entry-2025-12-10",
        "title": "10.12.2025 — Wednesday",
        "date": "2025-12-10",
        "excerpt": "Today was… honestly kinda okay. Not amazing. Not awful. Just one of those days that passes without leaving a mark.",
        "content": "Today was… honestly kinda okay.\nNot amazing. Not awful. Just one of those days that passes without leaving a mark.\n\nBut even when it's \"good,\" it still doesn't feel like the best day.\nI don't even remember the last time something felt like the best day.\n\nI woke up with that familiar heaviness — not full-on sadness, just that dull weight in my chest that decides the tone before I even open my eyes.\nDid the usual routine.\nPhone.\nBathroom.\nCoffee.\nAutopilot like always.\n\nAnd of course, the Christmas ads are already everywhere again.\n\nIt's fucking October.\n\nWhy are we doing this already?\nWhy is everyone pretending we need holiday cheer shoved down our throats two months early?\n\nThey're loud, fake, and honestly just exhausting.\nPerfect families.\nPerfect lights.\nPerfect bullshit.\n\nEvery jingle feels like someone poking my brain with a stick.\nIt doesn't make me excited.\nIt doesn't make me festive.\nIt just annoys the hell out of me.\n\nYeah, maybe it's a sin to hate Christmas this much.\nMaybe it really is.\nBut whatever — it's not like I can pretend I feel something I don't.\n\nPeople are already talking about plans, gifts, vibes, cookies, all that.\nGood for them.\n\nI'm just not there. Not even close.\n\nInside, it still feels quiet in that empty way —\nnot peaceful, not calm, just… space.\nSpace where something should be.\n\nSo yeah.\nToday was decent.\nBut not special.\nNot memorable.\nNot \"the best.\"\n\nJust another Wednesday drifting by."
    },
    {
        "slug": "entry-2025-12-06",
        "title": "6.12.2025 — Saturday",
        "date": "2025-12-06",
        "excerpt": "Today has just been… annoying as hell from the second I woke up.",
        "content": "Today has just been… annoying as hell from the second I woke up.\nNot the dramatic kind of bad day, just that stupid heavy feeling in my chest\nlike my brain already decided\n\"yeah, today is gonna suck a little.\"\n\nI got up, did the usual crap — phone, coffee, autopilot.\nAnd then out of nowhere\nthe fucking Christmas ads start blasting everywhere.\nWay too early.\nWay too loud.\n\nAll those fake happy families.\nThe perfect lights.\nThe stupid jingle bells in the background acting like the world isn't on fire half the time.\nIt's all so painfully artificial it almost makes me laugh.\nAlmost.\n\nIt doesn't put me in a good mood.\nIt doesn't make me feel cozy or festive.\nIt just pisses me off.\nLike the whole world is trying to force-feed me joy\nwhen I barely managed to wake up without swearing at the ceiling.\n\nEveryone's already \"getting into the Christmas spirit.\"\nGood for them, I guess.\nMeanwhile I'm sitting here trying not to scream\nbecause I'm absolutely not in the mood for any of this shit.\nNot the lights\nnot the music\nnot the cheesy ads pretending life is some perfect snow globe.\n\nI went outside for a bit\nfroze my ass off\nand saw people already hanging decorations\nlike the season is supposed to magically fix everything.\nBut it doesn't fix anything for me.\nIt just makes everything feel a bit heavier\na bit louder\na bit more fake.\n\nInside me it's just this weird quiet.\nNot peaceful.\nNot comforting.\nJust empty space where something should be.\n\nI don't know what I expected from today\nmaybe nothing\nmaybe just a normal Saturday\nnot this weird grey fog that followed me around all day.\n\nBut whatever.\nIt's evening now.\nAt least it's quiet.\nAt least no one's blasting another over-cheerful jingle in my face."
    },
    {
        "slug": "entry-2025-12-04",
        "title": "4.12.2025",
        "date": "2025-12-04",
        "excerpt": "Today moved in a soft grey tone. A day that did not ask for much and did not take much either.",
        "content": "Today moved in a soft grey tone. A day that did not ask for much and did not take much either.\nNothing collapsed. Nothing exploded. Nothing demanded my attention.\nA quiet stillness that felt almost unreal in its gentleness.\n\nI stayed home and let the silence settle around me like a blanket that did not fully warm me but kept the cold away.\nThe hours passed without sharp edges. No sudden drops. No unexpected turns.\nOnly a slow muted rhythm that felt strangely comforting.\n\nThere was a kind of honesty in that simplicity.\nNo performance. No pressure.\nJust me. Breathing. Existing. Watching the day unfold without trying to shape it into anything more.\n\nMaybe the quiet days matter more than I admit.\nWhen nothing breaks I finally have space to notice the small things.\nThe faint echo of my own thoughts.\nThe way the light shifts on the walls.\nThe calm that appears when everything else stops shouting.\n\nToday did not change me.\nBut it did not wear me down either.\nAnd maybe that is enough."
    }
]